import 'package:flutter/material.dart';

class alnaba extends StatelessWidget {
  const alnaba({
    Key? key,
  }) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: Colors.black,
      appBar: AppBar(
        backgroundColor: Colors.black,
      ),
      body: Container(
        child: Column(
          children: [
            Expanded(
              child: Row(
                children: [
                  Expanded(
                    flex: 3,
                    child: Container(
                      margin: EdgeInsets.only(left: 40),
                      child: Text(
                        'سورة النبا',
                        style: TextStyle(
                          fontSize: 30,
                          color: Color(0xFFb3b4ae),
                        ),
                      ),
                    ),
                  ),
                  Expanded(
                    flex: 2,
                    child: Image(
                      image: AssetImage("images/qur_profile.JPG"),
                    ),
                  ),
                ],
              ),
            ),
            Expanded(
              flex: 4,
              child: Container(
                width: 500,
                height: 300,
                child: SingleChildScrollView(
                  child: Card(
                    color: Color(0XFFf8f0e3),
                    child: Directionality(
                      textDirection: TextDirection.rtl,
                      child: Padding(
                        padding: const EdgeInsets.fromLTRB(0, 7.0, 10, 0),
                        child: Text(
                          'بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيم\nِ'
                              '\nعَمَّ يَتَسَاءَلُونَ ﴿۱﴾'
                              '\nعَنِ النَّبَإِ الْعَظِيمِ ﴿۲﴾'
                              '\nالَّذِي هُمْ فِيهِ مُخْتَلِفُونَ ﴿۳﴾'
                              '\nكَلَّا سَيَعْلَمُونَ ﴿۴﴾'
                              '\nثُمَّ كَلَّا سَيَعْلَمُونَ ﴿۵﴾'
                              '\nأَلَمْ نَجْعَلِ الْأَرْضَ مِهَادًا ﴿۶﴾'
                              '\nوَالْجِبَالَ أَوْتَادًا ﴿۷﴾'
                              '\nوَخَلَقْنَاكُمْ أَزْوَاجًا ﴿۸﴾'
                              '\nوَجَعَلْنَا نَوْمَكُمْ سُبَاتًا ﴿۹﴾'
                              '\nوَجَعَلْنَا اللَّيْلَ لِبَاسًا ﴿۱۰﴾'
                              '\nوَجَعَلْنَا النَّهَارَ مَعَاشًا ﴿۱۱﴾'
                              '\nوَبَنَيْنَا فَوْقَكُمْ سَبْعًا شِدَادًا ﴿۱۲﴾'
                              '\nوَجَعَلْنَا سِرَاجًا وَهَّاجًا ﴿۱۳﴾'
                              '\nوَأَنْزَلْنَا مِنَ الْمُعْصِرَاتِ مَاءً ثَجَّاجًا ﴿۱۴﴾'
                              '\nلِنُخْرِجَ بِهِ حَبًّا وَنَبَاتًا ﴿۱۵﴾'
                              '\nوَجَنَّاتٍ أَلْفَافًا ﴿۱۶﴾'
                              '\nإِنَّ يَوْمَ الْفَصْلِ كَانَ مِيقَاتًا ﴿۱۷﴾'
                              '\nيَوْمَ يُنْفَخُ فِي الصُّورِ فَتَأْتُونَ أَفْوَاجًا ﴿۱۸﴾'
                              '\nوَفُتِحَتِ السَّمَاءُ فَكَانَتْ أَبْوَابًا ﴿۱۹﴾'
                              '\nوَسُيِّرَتِ الْجِبَالُ فَكَانَتْ سَرَابًا ﴿۲۰﴾'
                              '\nإِنَّ جَهَنَّمَ كَانَتْ مِرْصَادًا ﴿۲۱﴾'
                              '\nلِلطَّاغِينَ مَآبًا ﴿۲۲﴾'
                              '\nَلابِثِينَ فِيهَا أَحْقَابًا ﴿۲۳﴾'
                              '\nلَا يَذُوقُونَ فِيهَا بَرْدًا وَلَا شَرَابًا ﴿۲۴﴾'
                              '\nإِلَّا حَمِيمًا وَغَسَّاقًا ﴿۲۵﴾'
                              '\nجَزَاءً وِفَاقًا ﴿۲۶﴾'
                              '\nإِنَّهُمْ كَانُوا لَا يَرْجُونَ حِسَابًا ﴿۲۷﴾'
                              '\nوَكَذَّبُوا بِآيَاتِنَا كِذَّابًا ﴿۲۸﴾'
                              '\nوَكُلَّ شَيْءٍ أَحْصَيْنَاهُ كِتَابًا ﴿۲۹﴾'
                              '\nفَذُوقُوا فَلَنْ نَزِيدَكُمْ إِلَّا عَذَابًا ﴿۳۰﴾'
                              '\nإِنَّ لِلْمُتَّقِينَ مَفَازًا ﴿۳۱﴾'
                              '\nحَدَائِقَ وَأَعْنَابًا ﴿۳۲﴾'
                              '\nوَكَوَاعِبَ أَتْرَابًا ﴿۳۳﴾'
                              '\nوَكَأْسًا دِهَاقًا ﴿۳۴﴾'
                              '\nلَا يَسْمَعُونَ فِيهَا لَغْوًا وَلَا كِذَّابًا ﴿۳۵﴾'
                              '\nجَزَاءً مِنْ رَبِّكَ عَطَاءً حِسَابًا ﴿۳۶﴾'
                              '\nرَبِّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا الرَّحْمَنِ لَا يَمْلِكُونَ مِنْهُ خِطَابًا ﴿۳۷﴾'
                              '\nيَوْمَ يَقُومُ الرُّوحُ وَالْمَلَائِكَةُ صَفًّا لَا يَتَكَلَّمُونَ إِلَّا مَنْ أَذِنَ لَهُ الرَّحْمَنُ وَقَالَ صَوَابًا ﴿۳۸﴾'
                              '\nذَلِكَ الْيَوْمُ الْحَقُّ فَمَنْ شَاءَ اتَّخَذَ إِلَى رَبِّهِ مَآبًا ﴿۳۹﴾'
                              '\n إِنَّا أَنْذَرْنَاكُمْ عَذَابًا قَرِيبًا يَوْمَ يَنْظُرُ الْمَرْءُ مَا قَدَّمَتْ يَدَاهُ وَيَقُولُ الْكَافِرُ يَا لَيْتَنِي كُنْتُ تُرَابًا ﴿۴۰﴾',
                          style: TextStyle(
                            color: Colors.black,
                            fontSize: 24,
                          ),
                        ),
                      ),
                    ),
                  ),
                ),
              ),
            ),
          ],
        ),
      ),
    );
  }
}
