import 'package:flutter/material.dart';

class naba extends StatelessWidget {
  const naba({
    Key? key,
  }) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: Colors.black,
      appBar: AppBar(
        backgroundColor: Colors.black,
      ),
      body: Container(
        child: Column(
          children: [
            Expanded(
              child: Row(
                children: [
                  Expanded(
                    flex: 3,
                    child: Container(
                      margin: EdgeInsets.only(left: 40),
                      child: Text(
                        'سورة النبا',
                        style: TextStyle(
                          fontSize: 30,
                          color: Color(0xFFb3b4ae),
                        ),
                      ),
                    ),
                  ),
                  Expanded(
                    flex: 2,
                    child: Image(
                      image: AssetImage("images/qur_profile.JPG"),
                    ),
                  ),
                ],
              ),
            ),
            Expanded(
              flex: 4,
              child: Container(
                width: 500,
                height: 300,
                child: SingleChildScrollView(
                  child: Card(
                    color: Color(0XFFf8f0e3),
                    child: Directionality(
                      textDirection: TextDirection.rtl,
                      child: Padding(
                        padding: const EdgeInsets.fromLTRB(0, 7.0, 10, 0),
                        child: Text(
                          'بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيم\nِ'
                          '\nبه نام خداوند رحمتگر مهربان'
                          '\nعَمَّ يَتَسَاءَلُونَ ﴿۱﴾'
                          '\nدرباره چه چيز از يكديگر مى ‏پرسند (۱)'
                          '\nعَنِ النَّبَإِ الْعَظِيمِ ﴿۲﴾'
                          '\nاز آن خبر بزرگ (۲)'
                          '\nالَّذِي هُمْ فِيهِ مُخْتَلِفُونَ ﴿۳﴾'
                          '\nكه در باره آن با هم اختلاف دارند (۳)'
                          '\nكَلَّا سَيَعْلَمُونَ ﴿۴﴾'
                          '\nنه چنان است به زودى خواهند دانست (۴)'
                          '\nثُمَّ كَلَّا سَيَعْلَمُونَ ﴿۵﴾'
                          '\nباز هم نه چنان است بزودى خواهند دانست (۵)'
                          '\nأَلَمْ نَجْعَلِ الْأَرْضَ مِهَادًا ﴿۶﴾'
                          '\nآيا زمين را گهواره‏ اى نگردانيديم (۶)'
                          '\nوَالْجِبَالَ أَوْتَادًا ﴿۷﴾'
                          '\nو كوهها را [چون] ميخهايى [نگذاشتيم] (۷)'
                          '\nوَخَلَقْنَاكُمْ أَزْوَاجًا ﴿۸﴾'
                          '\nو شما را جفت آفريديم (۸)'
                          '\nوَجَعَلْنَا نَوْمَكُمْ سُبَاتًا ﴿۹﴾'
                          '\nو خواب شما را [مايه] آسايش گردانيديم (۹)'
                          '\nوَجَعَلْنَا اللَّيْلَ لِبَاسًا ﴿۱۰﴾'
                          '\nو شب را [براى شما] پوششى قرار داديم (۱۰)'
                          '\nوَجَعَلْنَا النَّهَارَ مَعَاشًا ﴿۱۱﴾'
                          '\nو روز را [براى] معاش [شما] نهاديم (۱۱)'
                          '\nوَبَنَيْنَا فَوْقَكُمْ سَبْعًا شِدَادًا ﴿۱۲﴾'
                          '\nو بر فراز شما هفت [آسمان] استوار بنا كرديم (۱۲)'
                          '\nوَجَعَلْنَا سِرَاجًا وَهَّاجًا ﴿۱۳﴾'
                          '\nو چراغى فروزان گذارديم (۱۳)'
                          '\nوَأَنْزَلْنَا مِنَ الْمُعْصِرَاتِ مَاءً ثَجَّاجًا ﴿۱۴﴾'
                          '\nو از ابرهاى متراكم آبى ريزان فرود آورديم (۱۴)'
                          '\nلِنُخْرِجَ بِهِ حَبًّا وَنَبَاتًا ﴿۱۵﴾'
                          '\nتا بدان دانه و گياه برويانيم (۱۵)'
                          '\nوَجَنَّاتٍ أَلْفَافًا ﴿۱۶﴾'
                          '\nو باغهاى در هم پيچيده و انبوه (۱۶)'
                          '\nإِنَّ يَوْمَ الْفَصْلِ كَانَ مِيقَاتًا ﴿۱۷﴾'
                          '\nقطعا وعدگاه [ما با شما] روز داورى است (۱۷)'
                          '\nيَوْمَ يُنْفَخُ فِي الصُّورِ فَتَأْتُونَ أَفْوَاجًا ﴿۱۸﴾'
                          '\nروزى كه در صور دميده شود و گروه گروه بياييد (۱۸)'
                          '\nوَفُتِحَتِ السَّمَاءُ فَكَانَتْ أَبْوَابًا ﴿۱۹﴾'
                          '\nو آسمان گشوده و درهايى [پديد] شود (۱۹)'
                          '\nوَسُيِّرَتِ الْجِبَالُ فَكَانَتْ سَرَابًا ﴿۲۰﴾'
                          '\nو كوهها را روان كنند و [چون] سرابى گردند (۲۰)'
                          '\nإِنَّ جَهَنَّمَ كَانَتْ مِرْصَادًا ﴿۲۱﴾'
                          '\n[آرى] جهنم [از دير باز] كمينگاهى بوده (۲۱)'
                          '\nلِلطَّاغِينَ مَآبًا ﴿۲۲﴾'
                          '\n[كه] براى سركشان بازگشتگاهى است (۲۲)'
                          '\nَلابِثِينَ فِيهَا أَحْقَابًا ﴿۲۳﴾'
                          '\nروزگارى دراز در آن درنگ كنند (۲۳)'
                          '\nلَا يَذُوقُونَ فِيهَا بَرْدًا وَلَا شَرَابًا ﴿۲۴﴾'
                          '\nدر آنجا نه خنكى چشند و نه شربتى (۲۴)'
                          '\nإِلَّا حَمِيمًا وَغَسَّاقًا ﴿۲۵﴾'
                          '\nجز آب جوشان و چركابه‏ اى (۲۵)'
                          '\nجَزَاءً وِفَاقًا ﴿۲۶﴾'
                          '\nكيفرى مناسب [با جرم آنها] (۲۶)'
                          '\nإِنَّهُمْ كَانُوا لَا يَرْجُونَ حِسَابًا ﴿۲۷﴾'
                          '\nآنان بودند كه به [روز] حساب اميد نداشتند (۲۷)'
                          '\nوَكَذَّبُوا بِآيَاتِنَا كِذَّابًا ﴿۲۸﴾'
                          '\nو آيات ما را سخت تكذيب میکردند (۲۸)'
                          '\nوَكُلَّ شَيْءٍ أَحْصَيْنَاهُ كِتَابًا ﴿۲۹﴾'
                          '\nو حال آنكه هر چيزى را برشمرده [به صورت] كتابى در آورده‏ ايم (۲۹)'
                          '\nفَذُوقُوا فَلَنْ نَزِيدَكُمْ إِلَّا عَذَابًا ﴿۳۰﴾'
                          '\nپس بچشيد كه جز عذاب هرگز [چيزى] بر شما نمى‏ افزاييم (۳۰)'
                          '\nإِنَّ لِلْمُتَّقِينَ مَفَازًا ﴿۳۱﴾'
                          '\nمسلما پرهيزگاران را رستگارى است (۳۱)'
                          '\nحَدَائِقَ وَأَعْنَابًا ﴿۳۲﴾'
                          '\nباغچه ‏ها و تاكستانها (۳۲)'
                          '\nوَكَوَاعِبَ أَتْرَابًا ﴿۳۳﴾'
                          '\nو دخترانى همسال با سينه‏ هاى برجسته (۳۳)'
                          '\nوَكَأْسًا دِهَاقًا ﴿۳۴﴾'
                          '\nو پياله ‏هاى لبالب (۳۴)'
                          '\nلَا يَسْمَعُونَ فِيهَا لَغْوًا وَلَا كِذَّابًا ﴿۳۵﴾'
                          '\nدر آنجا نه بيهوده‏ اى شنوند و نه [يكديگر را] تكذيب [كنند] (۳۵)'
                          '\nجَزَاءً مِنْ رَبِّكَ عَطَاءً حِسَابًا ﴿۳۶﴾'
                          '\n[اين است] پاداشى از پروردگار تو عطايى از روى حساب (۳۶)'
                          '\nرَبِّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا الرَّحْمَنِ لَا يَمْلِكُونَ مِنْهُ خِطَابًا ﴿۳۷﴾'
                          '\nپروردگار آسمانها و زمين و آنچه ميان آن دو است بخشايشگرى كه كس را ياراى خطاب با او نيست (۳۷)'
                          '\nيَوْمَ يَقُومُ الرُّوحُ وَالْمَلَائِكَةُ صَفًّا لَا يَتَكَلَّمُونَ إِلَّا مَنْ أَذِنَ لَهُ الرَّحْمَنُ وَقَالَ صَوَابًا ﴿۳۸﴾'
                          '\nروزى كه روح و فرشتگان به صف مى‏ ايستند و [مردم] سخن نگويند مگر كسى كه [خداى] رحمان به او رخصت دهد و سخن راست گويد (۳۸)'
                          '\nذَلِكَ الْيَوْمُ الْحَقُّ فَمَنْ شَاءَ اتَّخَذَ إِلَى رَبِّهِ مَآبًا ﴿۳۹﴾'
                          '\nآن [روز] روز حق است پس هر كه خواهد راه بازگشتى به سوى پروردگار خود بجويد (۳۹)'
                          '\n إِنَّا أَنْذَرْنَاكُمْ عَذَابًا قَرِيبًا يَوْمَ يَنْظُرُ الْمَرْءُ مَا قَدَّمَتْ يَدَاهُ وَيَقُولُ الْكَافِرُ يَا لَيْتَنِي كُنْتُ تُرَابًا ﴿۴۰﴾'
                          '\nما شما را از عذابى نزديك هشدار داديم روزى كه آدمى آنچه را با دست ‏خويش پيش فرستاده است بنگرد و كافر گويد كاش من خاك بودم (۴۰)',
                          style: TextStyle(
                            color: Colors.black,
                            fontSize: 22,
                          ),
                        ),
                      ),
                    ),
                  ),
                ),
              ),
            ),
          ],
        ),
      ),
    );
  }
}
